# Using Pandas on Dataset

## Dataset - df.csv

### Pandas is already installed using Anaconda Navigator

In [21]:
import pandas as pd

#### 1. Import the dataset "df.csv"

In [22]:
df = pd.read_csv('Salaries.csv')

#### 2. Display how many rows and how many columns and Display first 10 rows and last 15 rows.

In [23]:
df.shape

(78, 6)

In [24]:
df.head(10)

        rank discipline   phd  service   sex    salary
0       Prof          B  56.0       49  Male  186960.0
1       Prof          A  12.0        6  Male   93000.0
2       Prof          A  23.0       20  Male  110515.0
3       Prof          A  40.0       31  Male  131205.0
4       Prof          B  20.0       18  Male  104800.0
5       Prof          A  20.0       20  Male  122400.0
6  AssocProf          A  20.0       17  Male   81285.0
7       Prof          A  18.0       18  Male       NaN
8       Prof          A  29.0       19  Male   94350.0
9       Prof          A  51.0       51  Male   57800.0

In [25]:
df.tail(15)

         rank discipline   phd  service     sex    salary
63       Prof          A  29.0       27  Female   91000.0
64  AssocProf          A  26.0       24  Female   73300.0
65       Prof          A  36.0       19  Female  117555.0
66   AsstProf          A   7.0        6  Female   63100.0
67       Prof          A  17.0       11  Female   90450.0
68   AsstProf          A   4.0        2  Female   77500.0
69       Prof          A  28.0        7  Female  116450.0
70   AsstProf          A   8.0        3  Female   78500.0
71  AssocProf          B  12.0        9  Female   71065.0
72       Prof          B  24.0       15  Female  161101.0
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

#### 3. Which Male and Female Professor has the highest and the lowest df?

In [26]:
max_salary_by_sex = df.groupby('sex')['salary'].max()
min_salary_by_sex = df.groupby('sex')['salary'].min()

highest_salary_male_professor = df[(df['sex'] == 'Male') & (df['salary'] == max_salary_by_sex['Male'])]
lowest_salary_male_professor = df[(df['sex'] == 'Male') & (df['salary'] == min_salary_by_sex['Male'])]

highest_salary_female_professor = df[(df['sex'] == 'Female') & (df['salary'] == max_salary_by_sex['Female'])]
lowest_salary_female_professor = df[(df['sex'] == 'Female') & (df['salary'] == min_salary_by_sex['Female'])]

print("Male Professor with the highest salary:")
print(highest_salary_male_professor)

print("\nMale Professor with the lowest salary:")
print(lowest_salary_male_professor)

print("\nFemale Professor with the highest salary:")
print(highest_salary_female_professor)

print("\nFemale Professor with the lowest salary:")
print(lowest_salary_female_professor)

Male Professor with the highest salary:
   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0

Male Professor with the lowest salary:
   rank discipline   phd  service   sex   salary
9  Prof          A  51.0       51  Male  57800.0

Female Professor with the highest salary:
    rank discipline   phd  service     sex    salary
72  Prof          B  24.0       15  Female  161101.0

Female Professor with the lowest salary:
         rank discipline   phd  service     sex   salary
54  AssocProf          A  25.0       22  Female  62884.0

#### 4. Which professor takes the highest and the lowest df

In [27]:
#Q4.Which Professor takes the highest and lowest df?

df[df["salary"]==df["salary"].max()]

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0

In [28]:
df[df["salary"]==df["salary"].min()]

   rank discipline   phd  service   sex   salary
9  Prof          A  51.0       51  Male  57800.0

#### 5. Missing 'Salaries' - should be replaced as mean of the matching salaries of those whose 'service' is the same

In [29]:
df.isnull().sum()

rank          0
discipline    0
phd           2
service       0
sex           0
salary        2
dtype: int64

In [30]:
print(df[df["salary"].isnull()])

        rank discipline   phd  service   sex  salary
7       Prof          A  18.0       18  Male     NaN
28  AsstProf          B   7.0        2  Male     NaN

In [31]:
mean_salaries_by_service = df.groupby('service')['salary'].transform('mean')
df['salary'].fillna(mean_salaries_by_service, inplace=True)

In [32]:
df.isnull().sum()

rank          0
discipline    0
phd           2
service       0
sex           0
salary        0
dtype: int64

#### 6. Missing ‘phd’ - should be replaced as mean of the matching ‘service’

In [33]:
mean_salaries_by_service = df.groupby('service')['phd'].transform('mean')
df['phd'].fillna(mean_salaries_by_service, inplace=True)

In [34]:
df.isnull().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64